// Типы переменных

// let - задает переменную

let number = 0 // тип данных - числовое
let str = "string" // тип данных - текстовое значение, строка
let bool = true
let n = undefined // забыли написать значение, показывает, когда переменная не определена
let n2 = null // специальное значение, которое представляет собой «ничего», «пусто» или «значение неизвестно», специально оставили пустым
let obj = {} // коробка с коробками

// let operators = 5+1 // можно сохранять значение какой-либо операции

let operators = "Макешов" + "Кубан" // конкатенация
let c = "fff" + "plov" + "manty"   // Nan Not a number

n2 = 1 // задаем значение переменной null

const a2 = 120 // закрепляет значение, делает его контстантой, неизменяемую переменну

let people = 2000

people = people + 1
people = people + 1
people = people + 1 // выведет в консоли = 2003, т.к. 





