// пишем в терминал Powershell git clone https://github.com/kubablack1997/js-course.git - ссылка на репозиторий - это все чтобы скопировать 
// репозиторий в папку в компе (создаст новую папку)

// shift + правая кнопка мыши - открыть Powershell здесь

// ReferenceError: ошибка генерируется при обращении к несуществующей ссылке, ошибка при обращении к переменной(опечатка, неправильное название)
// SyntaxError: представляет ошибку синтаксиса, ошибка при написании самого кода(скобки, циклы, условия, названия ключевых слов)
// TypeError: ошибка генерируется, если значение переменной или параметра представляют некорректный тип или пр попытке изменить значение, которое нельзя изменять
// (когда хочешь поменять конст, пытаешься применять методы одного типа к другому)

const user = 56
user = 58
